---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyCurveGstyleFor2010Mass
source: html/5355b614-e2fc-aed3-2114-b3ff8ae2c75e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyCurveGstyleFor2010Mass Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyCurveGstyleFor2010Mass { get; }
```